const paragraphs = [
    "يحكى أن رجلا عجوزا كان يعيش في قرية بعيدة، وكان أتعس شخص على وجه الأرض، حتى أن كل سكان القرية سئموا منه، لأنه كان محبطا على الدوام ولم يكن يمر يوم دون أن تراه في مزاج سيء. كان سكان القرية ينجنبونه قدر الإمكان، فسوء حظه أصبح معديا. لقد كان ينشر مشاعر الحزن والتعاسة لكل من حوله. لكن، وفي أحد الأيام وحينما بلغ العجوز من العمر ثمانين عاما، حدث شيء غريب، وبدأت إشاعة عجيبة في الانتشار: الرجل العجوز سعيد اليوم، إنه لا يتذمر من شيء، والابتسامة ترتسم على محياه، بل إن ملامح وجهه قد أشرقت وتغيرت تجمع القرويون عند منزل العجوز، وبادره أحدهم بالسؤال:  ما الذي حدث لك؟ وهنا أجاب العجوز:  لا شيء مهما لقد قضيت من عمري 80 عاما أطارد السعادة بلا طائل. ثم قررت بعدها أن أعيش من دونها، وأن أستمتع بحياتي وحسب، لهذا السبب أنا سعيد الان",
    "في تجربة قام بها أحد علماء الأحياء البحرية، تم وضع سمكة قرش كبيرة في حوض مائي، وأضيف بعد ذلك مجموعة من الأسماك الصغيرة كطعم للقرش. وكما هو متوقع فقد هجم القرش على الأسماك الصغيرة والتهمها كلها. بعد ذلك، وضع العالم فاصلا زجاجيا قسم به الحوض إلى قسمين متساويين، فجعل الأسماك الصغيرة في أحد الجانبين، وسمكة القرش في الجانب الاخر. هجم القرش في الحال، لكنه في هذه المرة اصطدم بالفاصل الزجاجي في حين كانت الأسماك الصغيرة تسبح بهدوء وأمان. وبعد مرور عدة ساعات استسلم القرش أخيرا وتوقّف عن المحاولة. تم تكرار التجربة مرات عديدة خلال الأسابيع القليلة اللاحقة عندها، أزال عالم الأحياء اللوح الزجاجي، لكن القرش لم يبادر بالهجوم هذه المرة أيضا، فقد أصبح مؤمنا تماما بوجود الحاجز الخفي بينه وبين الأسماك الصغيرة. ",
    "تعتبر مهنة الطبيب من المهن التي تتمتع بنوع من الصعوبة ، حيث أنها تتطلب اجتهادا للوصول الى المعدل الذي يمكن المرء من دخول كلية الطب ، كما ان دراسة العلوم الطبية تعتبر من أصعب الدراسات مقارنة بالتخصصات الأخرى ، وعند التخرج من هذا التخصص فإنه يتوجب على الطالب أن يضع أخلاقيات المهنة نصب عينيه فس أثناء ممارسة هذه المهنة ، كما أنه يجب عليه تأديتها بأمانة وإخلاص ومراعاة حق الناس في الحياة وأن أرواحهم أمانة بين يدي الطبيب . فيجب عليه ان يتحلى بالعديد من الصفات للممارسة هذه المهنة ، والعمل في مهنة الطبيب لا يكون بشكل فردي وإنما يكون ضمن كادر طبي يتكون من الأطباء والأخصائيين والممرضين والصيادلة حتى يحددوا العلاج المناسب ويقيموا حالة المريض على أكمل وجه ، وهذا ما يتطلب التمتع بروح الجماعة .",
    "لكل إنسان طموح حلم كبير يكبر معه منذ الطفولة ويسعى الى تحقيقه ولعل أكبر طموح يراود اي شخص هو مهنته المستقبلية التي يتمنى أن يعمل بها ، ومن أكثر المهن إثارة هي مهنة الطيار ، التي تجعل اي شخص يعمل فيها يعيش محلقاً مابين السماء والأرض وهو يقود الطائرة من دولة الى أخرى ، ويطير بها فوق البحار والأنهار والمحيطات والصحاري والجبال ، فهي مهنة جميلة مثيرة للدهشة وملهمة ، وتحتاج الى الكثير من المهارة والقدرة على التركيز وحب القيادة والرغبة الحقيقية في العمل. مهنة الطيار مهنة جميلة مليئة بالمغامرات الجميلة ، وتتيح مراقبة الغيوم والتحليق فوقع . لهذا تعطي للطيار فرصة ذهبية لرؤية أشياء كثيرة لا يمكن للأشخاص العاديين رؤيتها كما تعطيه فرصة للتمتع برؤية الأرض من مسافة بعيدة كما انها تعلم صاحبها الصبر وتعطيه البال الطويل ، والقدرة على التعامل مع الحالات الطارئة بسرعة كبيرة كما أن الطيار يتعرف على الكثير من الأشخاص من جنسيات مختلفة ، ويتعرف على ثقافات الشعوب ، ويكتسب لغات متعددة",
    "الخباز هو الشخص الذي يصنع الخبز من دقيق القمح او الشعير او الذرة إضافة لعديد المخبوزات او المعجنات الأخرى كالكعك وأنواع من المرطبات المكان الذي يعمل فيه الخباز يسمى المخبز . مهنته تعتبر من أقدم المهن فمنذ أن وجد الإنسان على الأرض وهو يصنع الخبز بشكل يومي .عندما تجلس الى المائدة وتجد رغيف الخبز الشهي امامك تذكر أنه مر بعديد المراحل حتى وصل الى صحنك لتأكله لقد كان هذا الرغيف حبات قمح ذهبية تتمايل في حقل الفلاح ثم حصده بالمنجل وحمله في أكياس الى المطحنة فطحنه العمال بكل جد حتى صار دقيقا ناعما .ثم بعد ذلك اشتراه الخباز وشمر عن ساعد الجد من ساعات الفجر الأولى فأحضر الماء الدافئ وعجن الدقيق ووضع عليه الخميرة . وبعد ساعة من الوقت خبزه الى أقراص متساوية ووضعها بكل عناية في فرن ضخم شديد الحرارة . استوت الأقراص وصارت أرغفة ناضجة فائحة الرائحة . وقدم الناس بعد ذلك من كل مكان لشراء الخبز اللذيذ .",
    "النجار هوالشخص الذي يصنع ويصلح الأشكال المصنوعة من الخشب ويتمتع بمهارة يدوية كبيرة في القيام بذلك يعمل النجار على إنشاء وتصليح السلالم الخشبية وإطارات الأبواب وتركيب الخزانات بالإضافية إلى دوره الأساسي في صناعة وإصلاح قطع الأثاث الخشبية مثل الطاولات والموائد والكراسي ويعتمد النجار على اخشاب الأشجار في التصنيع٠يستخدم النجار عددا كبيرا من الأدوات اليدوية والكهربائية لمساعدته على إتمام عمله يحتاج استخدام هذه الأدوات على اختلاف انواعها إلى دقة في التحكم ومهارة في الإستخدام لأن معظمها من الأدوات الحادة والمدببة والتي تتسبب بأذى كبيرفي حال سوء استخدامها أو عدم اتقان مهارات السيطرة عليها والتحكم بها٠ ",
    "مهنة الخزاف هي عبارة عن صناعة العديد من الأوعية وأواني الفخار من الصلصال وقد استخدمت هذه الأوعية لحفظ السوائل أو لتقديم الطعام بها، كما يتكون الفخار عادة من مادة اساسية وهي الصلصال الذي يتميز بسهولة تشكيله ،وثباته على الشكل المطلوب يصمم الخزاف الصلصال بإستخدام عجلة الفخار التي تعتمد على أداة تقوم بنسخه شكل النموذج الرئيسي وإنتاجه، ثم يصبه في قالب ، ويجففه أو يقطعه أو يختمه على شكل ألواح أو مربعات ، ثم يضع الخزاف الفخار على درجة حرارة عالية لتقويه،وتمكنه من حمل الماء٠ يتم غمر الإناء الفخار الحروق داخل سائل زجاجي معين ،وذلك لسد المسامات جميعها، وجعله غير راشح للماء، بالإضافة إلى إعطائه ملمساً زجاجياً ناعماً،ثم بعد ذلك يتم رفع الإناء من السائل الزجاجي، وتركه إلى أن يجف طبيعيا، ثم يوضع في الفرن ، لحرقه للمرة الثانية تحت درجة حرارة معينة ، حيث ينتج في النهاية منتج أملس، وناعم، وبراق مثل :المزهريات وفناجين الشاي، والأطباق، والتحف الصغيرة",
    "يحكى أن رجلا عجوزا كان يعيش في قرية بعيدة، وكان أتعس شخص على وجه الأرض، حتى أن كل سكان القرية سئموا منه، لأنه كان محبطا على الدوام ولم يكن يمر يوم دون أن تراه في مزاج سيء. كان سكان القرية ينجنبونه قدر الإمكان، فسوء حظه أصبح معديا. لقد كان ينشر مشاعر الحزن والتعاسة لكل من حوله. لكن، وفي أحد الأيام وحينما بلغ العجوز من العمر ثمانين عاما، حدث شيء غريب، وبدأت إشاعة عجيبة في الانتشار: الرجل العجوز سعيد اليوم، إنه لا يتذمر من شيء، والابتسامة ترتسم على محياه، بل إن ملامح وجهه قد أشرقت وتغيرت تجمع القرويون عند منزل العجوز، وبادره أحدهم بالسؤال:  ما الذي حدث لك؟ وهنا أجاب العجوز:  لا شيء مهما لقد قضيت من عمري 80 عاما أطارد السعادة بلا طائل. ثم قررت بعدها أن أعيش من دونها، وأن أستمتع بحياتي وحسب، لهذا السبب أنا سعيد الان",
    "في تجربة قام بها أحد علماء الأحياء البحرية، تم وضع سمكة قرش كبيرة في حوض مائي، وأضيف بعد ذلك مجموعة من الأسماك الصغيرة كطعم للقرش. وكما هو متوقع فقد هجم القرش على الأسماك الصغيرة والتهمها كلها. بعد ذلك، وضع العالم فاصلا زجاجيا قسم به الحوض إلى قسمين متساويين، فجعل الأسماك الصغيرة في أحد الجانبين، وسمكة القرش في الجانب الاخر. هجم القرش في الحال، لكنه في هذه المرة اصطدم بالفاصل الزجاجي في حين كانت الأسماك الصغيرة تسبح بهدوء وأمان. وبعد مرور عدة ساعات استسلم القرش أخيرا وتوقّف عن المحاولة. تم تكرار التجربة مرات عديدة خلال الأسابيع القليلة اللاحقة عندها، أزال عالم الأحياء اللوح الزجاجي، لكن القرش لم يبادر بالهجوم هذه المرة أيضا، فقد أصبح مؤمنا تماما بوجود الحاجز الخفي بينه وبين الأسماك الصغيرة. ",
    "تعتبر مهنة الطبيب من المهن التي تتمتع بنوع من الصعوبة ، حيث أنها تتطلب اجتهادا للوصول الى المعدل الذي يمكن المرء من دخول كلية الطب ، كما ان دراسة العلوم الطبية تعتبر من أصعب الدراسات مقارنة بالتخصصات الأخرى ، وعند التخرج من هذا التخصص فإنه يتوجب على الطالب أن يضع أخلاقيات المهنة نصب عينيه فس أثناء ممارسة هذه المهنة ، كما أنه يجب عليه تأديتها بأمانة وإخلاص ومراعاة حق الناس في الحياة وأن أرواحهم أمانة بين يدي الطبيب . فيجب عليه ان يتحلى بالعديد من الصفات للممارسة هذه المهنة ، والعمل في مهنة الطبيب لا يكون بشكل فردي وإنما يكون ضمن كادر طبي يتكون من الأطباء والأخصائيين والممرضين والصيادلة حتى يحددوا العلاج المناسب ويقيموا حالة المريض على أكمل وجه ، وهذا ما يتطلب التمتع بروح الجماعة .",
    "لكل إنسان طموح حلم كبير يكبر معه منذ الطفولة ويسعى الى تحقيقه ولعل أكبر طموح يراود اي شخص هو مهنته المستقبلية التي يتمنى أن يعمل بها ، ومن أكثر المهن إثارة هي مهنة الطيار ، التي تجعل اي شخص يعمل فيها يعيش محلقاً مابين السماء والأرض وهو يقود الطائرة من دولة الى أخرى ، ويطير بها فوق البحار والأنهار والمحيطات والصحاري والجبال ، فهي مهنة جميلة مثيرة للدهشة وملهمة ، وتحتاج الى الكثير من المهارة والقدرة على التركيز وحب القيادة والرغبة الحقيقية في العمل. مهنة الطيار مهنة جميلة مليئة بالمغامرات الجميلة ، وتتيح مراقبة الغيوم والتحليق فوقع . لهذا تعطي للطيار فرصة ذهبية لرؤية أشياء كثيرة لا يمكن للأشخاص العاديين رؤيتها كما تعطيه فرصة للتمتع برؤية الأرض من مسافة بعيدة كما انها تعلم صاحبها الصبر وتعطيه البال الطويل ، والقدرة على التعامل مع الحالات الطارئة بسرعة كبيرة كما أن الطيار يتعرف على الكثير من الأشخاص من جنسيات مختلفة ، ويتعرف على ثقافات الشعوب ، ويكتسب لغات متعددة",
    "الخباز هو الشخص الذي يصنع الخبز من دقيق القمح او الشعير او الذرة إضافة لعديد المخبوزات او المعجنات الأخرى كالكعك وأنواع من المرطبات المكان الذي يعمل فيه الخباز يسمى المخبز . مهنته تعتبر من أقدم المهن فمنذ أن وجد الإنسان على الأرض وهو يصنع الخبز بشكل يومي .عندما تجلس الى المائدة وتجد رغيف الخبز الشهي امامك تذكر أنه مر بعديد المراحل حتى وصل الى صحنك لتأكله لقد كان هذا الرغيف حبات قمح ذهبية تتمايل في حقل الفلاح ثم حصده بالمنجل وحمله في أكياس الى المطحنة فطحنه العمال بكل جد حتى صار دقيقا ناعما .ثم بعد ذلك اشتراه الخباز وشمر عن ساعد الجد من ساعات الفجر الأولى فأحضر الماء الدافئ وعجن الدقيق ووضع عليه الخميرة . وبعد ساعة من الوقت خبزه الى أقراص متساوية ووضعها بكل عناية في فرن ضخم شديد الحرارة . استوت الأقراص وصارت أرغفة ناضجة فائحة الرائحة . وقدم الناس بعد ذلك من كل مكان لشراء الخبز اللذيذ .",
    "النجار هوالشخص الذي يصنع ويصلح الأشكال المصنوعة من الخشب ويتمتع بمهارة يدوية كبيرة في القيام بذلك يعمل النجار على إنشاء وتصليح السلالم الخشبية وإطارات الأبواب وتركيب الخزانات بالإضافية إلى دوره الأساسي في صناعة وإصلاح قطع الأثاث الخشبية مثل الطاولات والموائد والكراسي ويعتمد النجار على اخشاب الأشجار في التصنيع٠يستخدم النجار عددا كبيرا من الأدوات اليدوية والكهربائية لمساعدته على إتمام عمله يحتاج استخدام هذه الأدوات على اختلاف انواعها إلى دقة في التحكم ومهارة في الإستخدام لأن معظمها من الأدوات الحادة والمدببة والتي تتسبب بأذى كبيرفي حال سوء استخدامها أو عدم اتقان مهارات السيطرة عليها والتحكم بها٠ ",
    "مهنة الخزاف هي عبارة عن صناعة العديد من الأوعية وأواني الفخار من الصلصال وقد استخدمت هذه الأوعية لحفظ السوائل أو لتقديم الطعام بها، كما يتكون الفخار عادة من مادة اساسية وهي الصلصال الذي يتميز بسهولة تشكيله ،وثباته على الشكل المطلوب يصمم الخزاف الصلصال بإستخدام عجلة الفخار التي تعتمد على أداة تقوم بنسخه شكل النموذج الرئيسي وإنتاجه، ثم يصبه في قالب ، ويجففه أو يقطعه أو يختمه على شكل ألواح أو مربعات ، ثم يضع الخزاف الفخار على درجة حرارة عالية لتقويه،وتمكنه من حمل الماء٠ يتم غمر الإناء الفخار الحروق داخل سائل زجاجي معين ،وذلك لسد المسامات جميعها، وجعله غير راشح للماء، بالإضافة إلى إعطائه ملمساً زجاجياً ناعماً،ثم بعد ذلك يتم رفع الإناء من السائل الزجاجي، وتركه إلى أن يجف طبيعيا، ثم يوضع في الفرن ، لحرقه للمرة الثانية تحت درجة حرارة معينة ، حيث ينتج في النهاية منتج أملس، وناعم، وبراق مثل :المزهريات وفناجين الشاي، والأطباق، والتحف الصغيرة"
];

const typingText = document.querySelector(".typing-text p"),
inpField = document.querySelector(".wrapper .input-field"),
tryAgainBtn = document.querySelector(".content button"),
timeTag = document.querySelector(".time span b"),
mistakeTag = document.querySelector(".mistake span"),
wpmTag = document.querySelector(".wpm span"),
cpmTag = document.querySelector(".cpm span");

let timer,
maxTime = 60,
timeLeft = maxTime,
charIndex = mistakes = isTyping = 0;

function loadParagraph() {
    const ranIndex = Math.floor(Math.random() * paragraphs.length);
    typingText.innerHTML = "";
    paragraphs[ranIndex].split("").forEach(char => {
        let span = `<span>${char}</span>`
        typingText.innerHTML += span;
    });
    typingText.querySelectorAll("span")[0].classList.add("active");
    document.addEventListener("keydown", () => inpField.focus());
    typingText.addEventListener("click", () => inpField.focus());
}

function initTyping() {
    let characters = typingText.querySelectorAll("span");
    let typedChar = inpField.value.split("")[charIndex];
    if(charIndex < characters.length - 1 && timeLeft > 0) {
        if(!isTyping) {
            timer = setInterval(initTimer, 1000);
            isTyping = true;
        }
        if(typedChar == null) {
            if(charIndex > 0) {
                charIndex--;
                if(characters[charIndex].classList.contains("incorrect")) {
                    mistakes--;
                }
                characters[charIndex].classList.remove("correct", "incorrect");
            }
        } else {
            if(characters[charIndex].innerText == typedChar) {
                characters[charIndex].classList.add("correct");
            } else {
                mistakes++;
                characters[charIndex].classList.add("incorrect");
            }
            charIndex++;
        }
        characters.forEach(span => span.classList.remove("active"));
        characters[charIndex].classList.add("active");

        let wpm = Math.round(((charIndex - mistakes)  / 5) / (maxTime - timeLeft) * 60);
        wpm = wpm < 0 || !wpm || wpm === Infinity ? 0 : wpm;
        
        wpmTag.innerText = wpm;
        mistakeTag.innerText = mistakes;
        cpmTag.innerText = charIndex - mistakes;
    } else {
        clearInterval(timer);
        inpField.value = "";
    }   
}

function initTimer() {
    if(timeLeft > 0) {
        timeLeft--;
        timeTag.innerText = timeLeft;
        let wpm = Math.round(((charIndex - mistakes)  / 5) / (maxTime - timeLeft) * 60);
        wpmTag.innerText = wpm;
    } else {
        clearInterval(timer);
    }
}

function resetGame() {
    loadParagraph();
    clearInterval(timer);
    timeLeft = maxTime;
    charIndex = mistakes = isTyping = 0;
    inpField.value = "";
    timeTag.innerText = timeLeft;
    wpmTag.innerText = 0;
    mistakeTag.innerText = 0;
    cpmTag.innerText = 0;
}

loadParagraph();
inpField.addEventListener("input", initTyping);
tryAgainBtn.addEventListener("click", resetGame);